cask_args appdir: "/Applications"

cask "java"
cask "visual-studio-code"
cask "vlc"
cask "iterm2"
cask "postico"
cask "telegram"
cask "google-chrome"

# System
brew "curl"
brew "wget"
brew "git"
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "tree"
brew "htop"
brew "pidof"
brew "pstree"
brew "grep"
brew "openssh"
brew "rsync"
brew "ssh-copy-id"
brew "dnstracer"
brew "sslscan"
brew "watch"
brew "telnet"
brew "gnupg"

brew "jq"

# Dev
brew "ruby"
brew "yarn"
brew "python"
brew "pyenv"
brew "go"
brew "cmake"
brew "openjdk"
brew "scala"
brew "sbt"